name: "ensemble_model"
platform: "ensemble"
max_batch_size: 16
input [
  {
    name: "input_0"
    data_type: TYPE_FP32
    dims: [ -1 ]
  }
]
output [
  {
    name: "output_0"
    data_type: TYPE_FP32
    dims: [ -1 ]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "simple_model"
      model_version: -1
      input_map {
        key: "INPUT"
        value: "input_0"
      }
      output_map {
        key: "OUTPUT"
        value: "input_0"
      }
    },
    {
      model_name: "simple_model"
      model_version: -1
      input_map {
        key: "INPUT"
        value: "input_0"
      }
      output_map {
        key: "OUTPUT"
        value: "output_0"
      }
    }
  ]
}
